src/cfe/КСП/InformationRegisters/КСП_ЗначенияПроизвольныхПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ЗначенияПроизвольныхПараметров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.КСП_ПроизвольныеПараметры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КСП_ПроизвольныеПараметры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_ЗначенияПроизвольныхПараметров/Ext/ManagerModule.bsl
Функция ПолучитьЗначениеПараметра(Параметр)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	КСП_ЗначенияПроизвольныхПараметров.Значение КАК ЗначениеПараметра
	               |ИЗ
	               |	РегистрСведений.КСП_ЗначенияПроизвольныхПараметров КАК КСП_ЗначенияПроизвольныхПараметров
	               |ГДЕ
	               |	КСП_ЗначенияПроизвольныхПараметров.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр",Параметр);
	
	ВыборкаЗапрос = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапрос.Следующий() Тогда
		Возврат ВыборкаЗапрос.ЗначениеПараметра;
	Иначе
		Возврат null;
	КонецЕсли;
	
КонецФункции
